<font color="blue">To use this notebook on Colaboratory, you will need to make a copy of it. Go to File > Save a Copy in Drive. You can then use the new copy that will appear in the new tab.</font>

# AfterWork Practice Notebook: Data Cleaning with Python

## 1. Standardisation

#### <font color="blue">Pre-requisites</font>

In [0]:
# Pre-requisite 1
# ---
# Importing pandas library
# ---
# -> This is a data analysis and manipulation library with Python.
# ---
# OUR CODE GOES BELOW
# 
import pandas as pd

In [0]:
# Pre-requisite 2
# ---
# Importing the numpy library
# -> This is a library for scientific computing with Python.
# -> It simply allows us to perfom complex mathematical operations.
# ---
# OUR CODE GOES BELOW
# 
import numpy as np

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [0]:
# Example 1
# --- 
# Renaming column names
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
#df=pd.read_csv('http://bit.ly/DataCleaningDataset', ';')

# Reading our dataset from the url
# ---
# We also specify the character ; as our separator
# ---
# 
df = pd.read_csv('account_dataset.csv')
df.head()

In [0]:
# Example 1a
# --- 
# In this example, we will renaming our columns, if we have many column names.
# We will use the str.strip(), str.lower(), str.replace() functions 
# to ensure that our column names are in lowercase format that easily can work with.
# ---
# str.strip() - We use this function to remove leading and trailing characters.
# str.lower() - This function converts all characters to lowercase
# str.replace() - This functions is used replace text with some other text.
# ---
#
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '')

# Then preview our dataframe
# ---
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [0]:
# Example 1b
# ---
# Alternatively we can rename column names in a dataframe manually by 
# specifying the column names that we would like to have. 
# Something to note is that this method becomes cumbersome when the no. of variables/features increase.
# ---
#

# We will reload our dataset again for this example and replace our dataframe
# with a new dataframe.
# ---
# 
df = pd.read_csv('http://bit.ly/DataCleaningDataset', ';') 

# We then specify our columns names, store them in a list, then afterwards
# assign the list to the column labels. By doing this, we replace the original
# columns with our new column names stored in the list.
# ---
# 
df.columns = ['name', 'city', 'country', 'height', 'weight', 'account_a', 'account_b', 'total_account']

# We then preview our dataframe as shown to confirm our changes
# ---
#
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

##### <font color="blue">Example 2</font>

In [0]:
# Example 2
# ---
# During standardisation, we can also perform string conversion. 
# In this example, we will convert the values of the column city to lower case values.
# From the previous example 1, we can see that the city column/feature has values 
# with Upppercase and Sentense case values.
# ---
# OUR CODE GOES BELOW
# 

# Lets convert the city column to comprise of only lowercase characters
# ---
# 
df['city'] = df['city'].str.lower()
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...      4340           6730
1          John Paul   london     ...     34334          38834
2        Cindy Jules   stockholm  ...      5504           8949
3      Arthur Kegels    brussels  ...      8999            300
4      Freya Bismark      berlin  ...     19000          26000

[5 rows x 8 columns]

##### <font color="blue">Example 3</font>

In [0]:
# Example 3
# ---
# We now perform types of conversion that we would want i.e. metric conversion.
# In this example, we convert our height values to centimeters having in mind 
# that 1 inch = 2.54 cm.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# 

# We perform our conversion across the column that we would want 
# then replace the column with the outcome of our conversion.
# ---
#
df['height'] = df['height'] * 2.54
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...      4340           6730
1          John Paul   london     ...     34334          38834
2        Cindy Jules   stockholm  ...      5504           8949
3      Arthur Kegels    brussels  ...      8999            300
4      Freya Bismark      berlin  ...     19000          26000

[5 rows x 8 columns]

##### <font color="blue">Example 4</font>

In [0]:
# Example 4
# ---
# We can also perform other types of conversion such as datatype conversion as shown
# ---


# Let's first determine the column/feature datatypes
# ---
# 
df.dtypes

name              object
city              object
country           object
height           float64
weight           float64
account_a        float64
account_b          int64
total_account      int64
dtype: object

In [0]:
# We then perform a conversion by converting our column/feature (height)
# through the use of the apply() function, passing the numerical 
# type (integer) provided by numpy as shown in this example.
# To get an understanding of other datatypes provided by numpy we can visit: 
# https://docs.scipy.org/doc/numpy/user/basics.types.html
# ---
# Other 
# ---
# 
df['height'] = df['height'].apply(np.int64)

# Let's now check whether our conversion happened by checking our updated datatypes.
# We want to see whether height feature was converted from float to integer.
# ---
# 
df.dtypes

name              object
city              object
country           object
height             int64
weight           float64
account_a        float64
account_b          int64
total_account      int64
dtype: object

In [0]:
# We can also refer to our previous values of the height feature in example 2,
# and we will see that our height values now only comprise of integers.
# Let's now inspect and see whether our changes took place.
# We will sample 5 records from our dataset. Let's run this cell.
# ---
# 
df.sample(5)

NameError: ignored

#### <font color="green">Challenges</font>

In [0]:
# Challenge 1
# ---
# Question: Convert the variables account_a and account_b to float datatype.
# ---
# Hint: You can refer to the dataset in the example.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
dataset = pd.read_csv('http://bit.ly/DataCleaningDataset', ';')
dataset.head()

                NAME        CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [0]:
# Challenge 2 (Optional)
# ---
# Question: Convert the given weight feature in the dataset from pounds to kgs. 
# ---
# Hint: 1 pound = 0.453592 kgs
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
dataset['WEIGHT']=dataset['WEIGHT']*0.453592
dataset.head(7)

                NAME               CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
2        Cindy Jules          Stockholm  ...      5504           8949
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949

[7 rows x 8 columns]

In [0]:
# Challenge 3 (Optional)
# ---
# Question: Rename the columns in the following dataset to contain lowercase characters.
# ---
# Hint: Remember to use a different dataframe name other than df i.e. gv_df
# ---
# Dataset url = http://bit.ly/GVProjectsFunding
# ---
# OUR CODE GOES BELOW
dataset.columns=dataset.columns.str.lower().str.strip().str.replace(' ', '_')
dataset.head()

            name        city  ... account_b  total_account
0       Adi Dako  LISBON      ...      4340           6730
1      John Paul   LONDON     ...     34334          38834
2    Cindy Jules   Stockholm  ...      5504           8949
3  Arthur Kegels    BRUSSELS  ...      8999            300
4  Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

## 2. Syntax Errors

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [0]:
# Example 1
# --- 
# While performing our analysis, we can get to a point where we need to 
# fix spelling mistakes or typos. This example will show us how we can 
# go about this.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
df=pd.read_csv('http://bit.ly/DataCleaningDataset', ';')
df.columns=dataset.columns.str.lower().str.strip().str.replace(' ', '_')

# Let's replacing any value "GERMANYY" with the correct value "GERMANY".
# We use the string replace() function to perform our operation as shown.
# ---
# 
df['country'] = df['country'].str.replace('GERMANYY', 'GERMANY')
df.head(11)

                name               city  ... account_b  total_account
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
2        Cindy Jules          Stockholm  ...      5504           8949
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949
7          John Paul          LONDON     ...      2300           6800

[8 rows x 8 columns]

##### <font color="blue">Example 2</font>

In [0]:
# Example 2
# ---
# We can also decide to strip or remove leading spaces (space infront) 
# and trailing spaces (spaces at the end) in our datset by using the 
# string strip() function covered in this example.
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# We first load our dataframe column with the intention to observ leading 
# and trailing spaces in the city column
# ---
# 
df['city']

0           LISBON
1            LONDON
2            Stockholm
3             BRUSSELS
4               Berlin
5         Brasilia
6            Stockholm
7            LONDON
Name: city, dtype: object

In [0]:
# Then later we strip the leading and trailing spaces as shown and lastly 
# confirm our changes by previewing the city column
# ---
# 
df['city'] = df['city'].str.strip()
df['city']

0       LISBON
1       LONDON
2    Stockholm
3     BRUSSELS
4       Berlin
5     Brasilia
6    Stockholm
7       LONDON
Name: city, dtype: object

#### <font color="green">Challenges</font>

In [0]:
# Challenge 1
# ---
# Question: Deal with the leading and trailing whitespaces from Name 
# and Team variables in the following dataset.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW

teams_df=pd.read_csv('http://bit.ly/NBABasketballDataset', ',')
teams_df['Name']= teams_df['Name'].str.strip()
teams_df['Team']= teams_df['Team'].str.strip()
teams_df.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter   oston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [0]:
# Challenge 2 (Optional)
# ---
# Question: Fix the spelling errors in the Team variable where it states "oston Celtics" to "Boston Celtics"
# ---
# Hint: To solve this challenge, you can perform two steps i.e. 
# Step 1: Replace "oston Celtics" with "Boston Celtics"
# Step 2: Replace "BBoston Celtics" with "Boston Celtics"
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
teams_df['Team']=teams_df['Team'].str.replace("oston Celtics", "Boston Celtics")
teams_df['Team']=teams_df['Team'].str.replace("BBoston Celtics", "Boston Celtics")
teams_df.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

## 3. Irrelevant Data

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [0]:
# Example 1
# --- 
# We can also delete/drop irrelevant columns/features. 
# By irrelevant we mean dataset features/columns that we don't need 
# to answer a research question. 
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
df=pd.read_csv("http://bit.ly/DataCleaningDataset", ";")
df.head()

                NAME        CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [0]:
# Deleting an Irrelevant Column i.e. if we don't require the column city 
# to answer our research question.
# ---
# While dropping/deleting those two columns:
# a) We set axis = 1
#    A dataframe has two axes: axis 0 and axis 1. 
#    axis 0 represents rows and axis 1 represents columns.
# b) We can also set Inplace = True.
#    This means the changes would be made to the original dataframe.
# Dropping the irrelevant columns i.e. Team and Weight
# Those values were dropped since axis was set equal to 1 and 
# the changes were made in the original data frame since inplace was True.
# 
df.drop(["city"], axis = 1, inplace = True) 
 
# And preview our resulting dataset
# ---
# 
df.head()

                name         country  ...  account_b  total_account
0          Adi Dako    PORTUGAL       ...       4340           6730
1          John Paul  UNITED KINGDOM  ...      34334          38834
2        Cindy Jules          Sweden  ...       5504           8949
3      Arthur Kegels         BELGIUM  ...       8999            300
4      Freya Bismark         GERMANY  ...      19000          26000

[5 rows x 7 columns]

In [0]:
# We can drop multiple columns as shown
# ---
# 
df.drop(["height", "weight"], axis = 1, inplace = True) 

# And preview our resulting dataset 
# --- 
# 
df.head()

                name         country  account_a  account_b  total_account
0          Adi Dako    PORTUGAL          2390.0       4340           6730
1          John Paul  UNITED KINGDOM     4500.0      34334          38834
2        Cindy Jules          Sweden        NaN       5504           8949
3      Arthur Kegels         BELGIUM     4344.0       8999            300
4      Freya Bismark         GERMANY     7000.0      19000          26000

##### <font color="blue">Example 2</font>

In [0]:
# Example 2
# ---
# We can also fix in-record & cross-datasets errors. 
# These kinds errors result from having two or more values in the same row 
# or across datasets contradicting with each other.
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 
df['total_account_2'] = df['account_a'] + df['account_b']

# Previewing our resulting dataframe 
# ---
#
df.head()

                name        city  ... total_account  total_account_2
0          Adi Dako   LISBON      ...          6730           6730.0
1          John Paul   LONDON     ...         38834          38834.0
2        Cindy Jules   Stockholm  ...          8949              NaN
3      Arthur Kegels    BRUSSELS  ...           300          13343.0
4      Freya Bismark      Berlin  ...         26000          26000.0

[5 rows x 9 columns]

In [0]:
# Create another column to tell us whether if the two columns match.
# We will use the numpy library through use of np.
# ---
# 
df['total_account?'] = np.where(df['total_account'] == df['total_account_2'], 'True', 'False')

# Previewing our resulting dataframe 
# ---
# 
df.head()

                name        city  ... total_account_2  total_account?
0          Adi Dako   LISBON      ...          6730.0            True
1          John Paul   LONDON     ...         38834.0            True
2        Cindy Jules   Stockholm  ...             NaN           False
3      Arthur Kegels    BRUSSELS  ...         13343.0           False
4      Freya Bismark      Berlin  ...         26000.0            True

[5 rows x 10 columns]

In [0]:
# Let's now select the records which don't match 
# ---
# 
df.loc[df['total_account?'] == "False"]

                name               city  ... total_account_2  total_account?
2        Cindy Jules          Stockholm  ...             NaN           False
3      Arthur Kegels           BRUSSELS  ...         13343.0           False
5         Rena Filip       Brasilia      ...          8998.0           False

[3 rows x 10 columns]

In [0]:
# At this point we can do several things
# 1. Correct the values,
# 2. Drop/Delete the values,
# 3. Or even decide to leave them as they are for certain reasons
# ---
# If we had a large dataset, we could get the no. of records using len(),
# this would help us in our decision making process.
# ---
# 
len(df.loc[df['total_account?'] == "False"])

3

#### <font color="green">Challenges</font>

In [0]:
# Challenge 1 
# ---
# Question: While perfoming some analysis to answer a research question, 
# we realize that we don't need the team and weight columns in our dataset. 
# Let's drop those two columns below
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
teams_df= pd.read_csv('http://bit.ly/NBABasketballDataset', ',')
teams_df.columns= teams_df.columns.str.strip().str.lower().str.replace(' ','_')
teams_df.drop(['team','weight'], axis=1, inplace=True)
teams_df.head()

            name  number position   age height            college     salary
0  Avery Bradley     0.0       PG  25.0    6-2              Texas  7730337.0
1    Jae Crowder    99.0       SF  25.0    6-6          Marquette  6796117.0
2   John Holland    30.0       SG  27.0    6-5  Boston University        NaN
3    R.J. Hunter    28.0       SG  22.0    6-5      Georgia State  1148640.0
4  Jonas Jerebko     8.0       PF  29.0   6-10                NaN  5000000.0

In [0]:
# Challenge 2 (Optional)
# ---
# Question: Check for in-record and cross-dataset errors given the following dataset
# Hint: 
# -> Perform other data cleaning techniques that you have learned so far for ease of working.
# -> Total_Budget_Supported__by_Donors_KES = Total_-_Loan_Budget_Est_KES + Total_-_Grant_Budget_Est_KES
# ---
# Dataset url = http://bit.ly/GVProjectsFundingDataset
# ---
# OUR CODE GOES BELOW
gv_df=pd.read_csv('http://bit.ly/GVProjectsFundingDataset',',')
gv_df.columns=gv_df.columns.str.strip().str.lower().str.replace('-_','')
gv_df['total_budget_supported__by_donors_kes_2']=gv_df['total_loan_budget_est_kes'] + gv_df['total_grant_budget_est_kes']
gv_df['total_budget_supported__by_donors_kes?']=np.where(gv_df['total_budget_supported__by_donors_kes_2']==gv_df['total_budget_supported__by_donors_kes'], 'True','False')
gv_df.loc[gv_df['total_budget_supported__by_donors_kes?'] == 'False']
len(gv_df.loc[gv_df['total_budget_supported__by_donors_kes?'] == 'False'])

5

## 4. Duplicates

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [0]:
# Example 1
# --- 
# Finding duplicate records
# -> Duplicate records are repeated records in a dataset.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
# 

df = pd.read_csv('http://bit.ly/NBABasketballDataset')
 
# Again, we first explore our dataset by determining the shape of 
# our dataset (records/instances, columns/variables)
# ---
# 
df.shape

(458, 9)

In [0]:
# We can then identify which observations are duplicates
# through the duplicated() function and sum() to know how many
# duplicate records there are.
# Normally, duplicate records are dropped from the dataset.
# But in our case we don't have any duplicate records.
# ---
#
df = df[~df.duplicated()]
df

                name               city  ... account_b  total_account
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
2        Cindy Jules          Stockholm  ...      5504           8949
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949
7          John Paul          LONDON     ...      2300           6800

[8 rows x 8 columns]

In [0]:
# Finding the no. of duplicates
# ---
# 
sum(df.duplicated())

0

##### <font color="blue">Example 2</font>

In [0]:
# Example 2
# ---
# Dropping duplicate columns
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# In our previous dataset, if there were duplicates we
# could have dropped the through the use of the drop_duplicates() function 
# as shown in this example 
# ---
# 
df_duplicates = df.drop_duplicates()
df_duplicates

                name               city  ... account_b  total_account
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
2        Cindy Jules          Stockholm  ...      5504           8949
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949
7          John Paul          LONDON     ...      2300           6800

[8 rows x 8 columns]

##### <font color="blue">Example 3</font>

In [0]:
# Example 3
# ---
# Dropping duplicates in a specific column
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
df=pd.read_csv('http://bit.ly/DataCleaningDataset',';')
df.columns=df.columns.str.lower().str.strip().str.replace(' ', '_')

# We can also consider records with repeated variables/columns 
# as duplicates and deal with them. For example, we can 
# identify duplicates in our dataset based on country.
# ---
#  
duplicates_df = df[df.duplicated(['country'])] 
duplicates_df

          name       city         country  ...  account_a  account_b  total_account
6  Cindy Jules  Stockholm          Sweden  ...     3445.0       5504           8949
7    John Paul  LONDON     UNITED KINGDOM  ...     4500.0       2300           6800

[2 rows x 8 columns]

In [0]:
# Then dropping the duplicates as shown below.
# NB: We will create in a new dataframe object which will contain our unique dataframe
# which won't have any duplicates.
# --- 
# 
unique_df = df.drop_duplicates(['country'])

# Determining the size of our new dataset 
# We note that the two records were dropped from our original dataset
# ---
# 
unique_df.shape

(6, 8)

#### <font color="green">Challenges</font>

##### <font color="green">Challenge 1</font>

In [0]:
# Challenge 1
# ---
# Question: Find duplicates in the following dataset.
# ---
# Dataset url = http://bit.ly/StaffDataset
# ---
# OUR CODE GOES BELOW
staff_df=pd.read_csv('http://bit.ly/StaffDataset',',')
staff_df.columns=staff_df.columns.str.lower().str.strip().str.replace(' ','_')
print(sum(staff_df.duplicated()))
duplicates_staff_df=staff_df.duplicated()
unique_staff_df=staff_df.drop_duplicates()
unique_staff_df.shape
#staff_df.shape
staff_df.head()

20

  first_name  gender  start_date  ... bonus_%  senior_management             team
0      Scott     NaN   7/11/1991  ...   5.218              False            Legal
1      Terry    Male  11/27/1981  ...  13.464               True  Client Services
2   Benjamin    Male   1/26/2005  ...   7.008               True            Legal
3  Christina  Female    8/6/2002  ...   9.096               True      Engineering
4      Joyce     NaN   2/20/2005  ...  12.752              False          Product

[5 rows x 8 columns]

##### <font color="green">Challenge 2</font>

In [0]:
# Challenge 2 (Optional)
# ---
# Question: Dealing with duplicates in the given dataset.
# ---
# Dataset url = http://bit.ly/StaffDataset.
# ---
# OUR CODE GOES BELOW
#

## 5. Missing Data

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [0]:
# Example 1
# --- 
# Finding records with missing data
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# We can check if there is any missing values in the entire dataframe as shown 
# NB: This method may not be the most convenient. Why?
# ---
# 
df.isnull()

    name   city  country  height  weight  account_a  account_b  total_account
0  False  False    False   False   False      False      False          False
1  False  False    False   False   False      False      False          False
2  False  False    False   False   False       True      False          False
3  False  False    False   False   False      False      False          False
4  False  False    False   False   False      False      False          False
5  False  False    False   False   False      False      False          False
6  False  False    False   False   False      False      False          False
7  False  False    False   False    True      False      False          False

In [0]:
# We can also check for missing values in each column 
# NB: This method may not be the most convenient. Why?
# Let's uncomment the following line
# ---
# 
df.isnull().any()

name             False
city             False
country          False
height           False
weight            True
account_a         True
account_b        False
total_account    False
dtype: bool

In [0]:
# We can check how many missing values there are across each variable/column by 
# ---
# 
df.isnull().sum()

name             0
city             0
country          0
height           0
weight           1
account_a        1
account_b        0
total_account    0
dtype: int64

In [0]:
# We can also check to see if we have any missing values in the dataframe by 
# ---
# 
df.isnull().values.any()

True

In [0]:
# Lastly, We can also get a total count of missing values by 
#
# ---
df.isnull().sum().sum()

2

##### <font color="blue">Example 2</font>

In [0]:
# Example 2
# ---
# Dealing with the missing data
# ---
# 

# We can drop rows where all cells in that row is NA
# Let's uncomment the following line
# NB: We don't have these rows in our dataset 
# ---
#
df_cleaned = df.dropna(how='all')
df_cleaned

In [0]:
# We can also drop columns if they only contain missing values
# NB: We don't have these rows in our dataset 
# ---
# 
df_without_columns = df.dropna(axis=1, how='all')
df_without_columns

                name               city  ... account_b  total_account
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
2        Cindy Jules          Stockholm  ...      5504           8949
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949
7          John Paul          LONDON     ...      2300           6800

[8 rows x 8 columns]

In [0]:
# We can drop rows that contain less than five observations
# NB: We don't have these rows in our dataset 
# ---
# 
df.dropna(thresh=5)

                name               city  ... account_b  total_account
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
2        Cindy Jules          Stockholm  ...      5504           8949
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949
7          John Paul          LONDON     ...      2300           6800

[8 rows x 8 columns]

In [0]:
# Lastly, we can also drop the missing observations
# Let's uncomment the following two lines
# ---
#
df_no_missing = df.dropna()
df_no_missing


# There are many methods of dealing with missing data however, 
# we only dealt with the above basic ones due to time constraints.

                name               city  ... account_b  total_account
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949

[6 rows x 8 columns]

##### <font color="blue">Example 3</font>

In [0]:
# Example 3
# ---
# Flag missing values
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# 

# We can also fill in missing data with zeros as shown.
# NB: We will create a copy of the original dataframe
# Let's uncomment the following line 
# ---
# 
df2 = df.copy()
df3 = df2.fillna(0)
df3

                name               city  ... account_b  total_account
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
2        Cindy Jules          Stockholm  ...      5504           8949
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949
7          John Paul          LONDON     ...      2300           6800

[8 rows x 8 columns]

#### <font color="green">Challenges</font>

In [0]:
# Challenge 1
# ---
# Question: Find missing values in the following dataset.
# ---
# Dataset url = http://bit.ly/DCTitanicDataset
# ---
# OUR CODE GOES BELOW
titanic_df=pd.read_csv('http://bit.ly/DCTitanicDataset', ',')
titanic_df.head()
titanic_df.isnull().sum().sum()

3869

In [0]:
# Challenge 2 (Optional)
# ---
# Question: Drop the variables with more than 500 missing values.
# ---
# Dataset url = http://bit.ly/DCTitanicDataset
# ---
# OUR CODE GOES BELOW
#
new=titanic_df.dropna(axis=1, thresh=500)
new

      pclass  survived  ... embarked                        home.dest
0        1.0       1.0  ...        S                     St Louis, MO
1        1.0       1.0  ...        S  Montreal, PQ / Chesterville, ON
2        1.0       0.0  ...        S  Montreal, PQ / Chesterville, ON
3        1.0       0.0  ...        S  Montreal, PQ / Chesterville, ON
4        1.0       0.0  ...        S  Montreal, PQ / Chesterville, ON
...      ...       ...  ...      ...                              ...
1305     3.0       0.0  ...        C                              NaN
1306     3.0       0.0  ...        C                              NaN
1307     3.0       0.0  ...        C                              NaN
1308     3.0       0.0  ...        S                              NaN
1309     NaN       NaN  ...      NaN                              NaN

[1310 rows x 11 columns]

## 6. Outliers

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [0]:
# Example 1
# --- 
# Given the following dataset, find and deal with outliers.
# ---
# Dataset url = http://bit.ly/CountryDataset1
# ---
# OUR CODE GOES BELOW
#  

# Let's read data from url as dataframe
# 
outliersc_df = pd.read_csv("http://bit.ly/CountryDataset1") 

# Lets preview our our dataframe below
#
outliersc_df.head()

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [0]:
# Checking the size of our dataset for cleaning purposes
# ---
#
outliersc_df.shape

(1704, 6)

In [0]:
# There are many ways of dealing with the outliers however in this session we wiil 
# use the interquartile range (IQR). 
# The IQR is the first quartile subtracted from the third quartile, 
# i.e. the range covered by the middle 50% of the data. Values outside this range
# will be considered as outliers. If we were to use a box plot visualisation then,
# we would be able to visually see those values outside this range. 
# Something to note is that this method will consider only the numerical values in 
# our dataset. Lets now calculate the IQR for each column.
# ---
#

# We first defining our quantiles using the quantile() function
# ---
# 
Q1 = outliersc_df.quantile(0.25)
Q3 = outliersc_df.quantile(0.75)
IQR = Q3 - Q1
IQR

# Then filtering out now filter out outliers by getting values which are outside our IQR Range.
# ---
#
outliers_df_iqr = outliersc_df[((outliersc_df < (Q1 - 1.5 * IQR)) | (outliersc_df > (Q3 + 1.5 * IQR))).any(axis=1)]

# Checking the size of the dataset with outliers for cleaning purposes
# ---
#
outliers_df_iqr.shape

(317, 6)

In [0]:
# We can also explore our outliers by doing the following
# ---
# 
outliers_df_iqr

        country  year         pop continent  lifeExp     gdpPercap
67    Australia  1987  16257249.0   Oceania   76.320  21888.889030
68    Australia  1992  17481977.0   Oceania   77.560  23424.766830
69    Australia  1997  18565243.0   Oceania   78.830  26997.936570
70    Australia  2002  19546792.0   Oceania   80.370  30687.754730
71    Australia  2007  20434176.0   Oceania   81.235  34435.367440
...         ...   ...         ...       ...      ...           ...
1651    Vietnam  1987  62826491.0      Asia   62.820    820.799445
1652    Vietnam  1992  69940728.0      Asia   67.662    989.023149
1653    Vietnam  1997  76048996.0      Asia   70.672   1385.896769
1654    Vietnam  2002  80908147.0      Asia   73.017   1764.456677
1655    Vietnam  2007  85262356.0      Asia   74.249   2441.576404

[317 rows x 6 columns]

In [0]:
# Lastly, the most common method of handling our outliers is to drop them.
# In some cases we can:
# 1. Leave them if they are genuine
# 2. Replace them with values within the IQR range
# 3. Drop them
# ---
# In our case, we will drop them.
# We just use the "~" character to refer to the other part of the dataset that 
# does not have outliers
# ---
# 
clean_dfc_iqr = outliersc_df[ ~((outliersc_df < (Q1 - 1.5 * IQR)) | (outliersc_df > (Q3 + 1.5 * IQR))).any(axis=1)]

# Checking the size of our final dataset.
clean_dfc_iqr.shape

(1387, 6)

#### <font color="green">Challenges</font>

In [0]:
# Challenge 1 
# ---
# Question: Find and Deal with the outliers in the given dataset.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
outliersx_df=pd.read_csv('http://bit.ly/DataCleaningDataset', ';')
Q1= outliersx_df.quantile(0.25)
Q3= outliersx_df.quantile(0.75)
IQR= Q3-Q1
IQR
outliersx_df_iqr = outliersx_df[((outliersx_df < (Q1 - (1.5 * IQR ))) | (outliersx_df > (Q3 + (1.5 * IQR)))).any(axis=1)]
outliersx_df_iqr.shape
clean_df_iqr = outliersx_df[ ~((outliersx_df < (Q1 - (1.5 * IQR))) | (outliersx_df > (Q3 + (1.5 * IQR)))).any(axis=1)]
clean_df_iqr.shape

(5, 8)